{
  "projects": [
    {
      "title": "FitFolio",
      "stack": [
        "React",
        "JavaScript",
        "Firebase",
        "React Router",
        "NodeJS",
        "MongoDB",
        "ExpressJS",
        "JWT (Json Web Token)",
        "Stripe API"

      ],
      "description": "FitFolio is a modern web application designed to connect fitness enthusiasts with professional trainers. Users can browse trainers, book classes, manage schedules, and make secure payments — all within a clean, intuitive interface. Trainers can manage their classes and slots, while admins oversee the platform.",
      "liveUrl": "https://fitfolio-by-shahrin.web.app/",
      "sourceUrl": "",
      "keyFeatures": [
        "Separate dashboards and permissions for Users, Trainers, and Admins.",
        "Real-time payment confirmation and booking status updates.",
        "Monitor bookings, payments, and user activities.",
        "Manage user roles and platform content.",
        "View analytics: total revenue, recent transactions, user growth."
      ],
      "image": "https://i.ibb.co/Rk1xfmrh/Screenshot-2025-06-28-194459.png",
      "challenges": "Implementing a secure booking and payment system was complex, and ensuring real-time schedule updates for trainers and clients required careful database design.",
      "improvements": "I plan to add in-app chat, personalized fitness analytics, and push notifications to boost client engagement."
    },
    
    {
      "title": "MathMatter",
      "stack": [
        "React",
        "JavaScript",
        "Firebase",
        "MongoDB",
        "NodeJS",
        "ExpressJS",
        "React Router",
        "JWT (Json Web Token)"
      ],
      "description": "MathMatter is an interactive web app that makes learning mathematics engaging through practice tools, problem sets, visualizations, and progress tracking.",
      "liveUrl": "https://mathmatter-by-shahrin-tarin.web.app/",
      "sourceUrl": "https://github.com/ShahrinTarin/mathematter",
      "keyFeatures": [
        "Filter blogs by category or title using query parameters.",
        "Rank blogs by length of description for easy discovery.",
        "Add, edit, delete, and comment on blogs with real-time updates.",
        "Motion animations and tooltips enhance user experience."
      ],
      "image": "https://i.ibb.co/7xFwz99G/Screenshot-2025-06-28-194324.png",
      "challenges": "Designing an intuitive UX for complex math interactions was tricky. Handling large sets of practice problems and ensuring smooth performance required optimization.",
      "improvements": "Future plans include adding gamification features, advanced analytics for progress tracking, and integrating AI-based practice recommendations."
    },

    {
      "title": "StoveStories",
      "stack": [
        "React",
        "JavaScript",
        "Firebase",
        "MongoDB",
        "NodeJS",
        "ExpressJS",
        "React Router"
      ],
      "description": "StoveStories is a vibrant recipe book website that empowers users to share, explore, and save recipes, connecting food lovers through cooking stories.",
      "liveUrl": "https://stovestories-1a7e6.web.app/",
      "sourceUrl": "https://github.com/ShahrinTarin/StoveStore",
      "keyFeatures": [
        "User-generated recipes with images, preparation times, and categories.",
        "Like, edit, or delete recipes with real-time updates.",
        "Personalized recipe collections filtered by user ID.",
        "Integrated tooltips and animations for enhanced user experience."
      ],
      "image": "https://i.ibb.co/KchFkG10/Screenshot-2025-06-28-194233.png",
      "challenges": "Managing real-time updates and data consistency across multiple users was challenging. Implementing secure authentication and authorization also required careful planning.",
      "improvements": "In the future, I plan to add a social feed, advanced search filters, and integration with third-party recipe APIs to expand the recipe database."
    }
  ]
}
